Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Diameter
The Diameter class represents the diameter filter expression.

Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Diameter.#ctor
Initializes a new instance of the Diameter class.